/* 三角形一次要素 数値積分版 および 形状変換関数 */

element p1[tri] {
  (0,0): 1 - r - s;
  (1,0): r;
  (0,1): s;
}


/* 三角形二次要素 数値積分版 */

element p2[tri] {
  (0,0): (1-r-s)*(2*(1-r-s) - 1);
  (1,0): r * ( 2 * r - 1);
  (0,1): s * ( 2 * s - 1);
}


/* 三角形２次要素 解析積分版 */
element T6[tri] {
(0,0)  : L1*( 2*L1*L1 - 1);
(1/2,0): 4*L2 * L1;
(1,0)  : L2 - 2*L2*L2;
(1/2,1/2): 4 * L2 * L3;
(0,1)  : L3 - 2*L3*L3;
(0,2/4): 4 * L3 * L1;
}

/* 三角形１０節点エルミート要素 */
element T10[tri] {
(0,0): 3*L1*L1 - 2 * L1*L1*L1 - 7*L1*L2*L3;
(0,1)[dy]: L3*L3*L3 - L3*L3 + 2*L1*L2*L3;
(1/3,1/3):27*L1*L2*L3;
(1,0)[dx]: L2*L2*L2 - L2*L2 + 2*L1*L2*L3;

(0,1)[dx]: L2*L3*L3 - L1*L2*L3;
(1,0): 3*L2*L2 - 2 * L2*L2*L2 - 7*L1*L2*L3;
(1,0)[dy]: L2*L2*L3 -L1*L2*L3;
(0,1): L3*L3*3 - 2*L3*L3*L3 - 7*L1*L2*L3;
(0,0)[dx] : L2*L1*L1 - L1*L2*L3;
(0,0)[dy] : L3*L1*L1 - L1*L2*L3;
}

